{
    "name": "Портал у Край",
    "icon": "minecraft:end_portal_frame",
    "category": "patchouli:world_category",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "Щоб відкрити портал для фінального випробування цього світу, вам потрібно знайти 12 різних очей Краю. Вони знаходяться в різних куточках світу: випадають із босів, купуються, а також створюються за допомогою магічних дій!"
        },
        {
            "type": "spotlight",
            "title": "Чорне Око",
            "text": "Пірати кажуть, що це око дало їм можливість побачити легендарну Чорну перлину. Його можна отримати, перемігши Зберігача стародавнього міста, що знаходиться глибоко під землею.",
            "item": "endrem:black_eye"
        },
        {
            "type": "spotlight",
            "title": "Крижане Око",
            "text": "Один із головних артефактів цього всесвіту, залишених льодологами перед тим, як усі вони раптово зникли зі світу. Випадає з Крижаної Пащі, названої на честь зникнення льодологів.",
            "item": "endrem:cold_eye"
        },
        {
            "type": "spotlight",
            "title": "Пошкоджене Око",
            "text": "Око жадібного короля, що потьмяніло на самоті. Легенда свідчить, що воно принесе своєму власнику нескінченне багатство. Знайти це око можна у розбійників у вежах.",
            "item": "endrem:corrupted_eye"
        },
        {
            "type": "spotlight",
            "title": "Прокляте Око",
            "text": "Могутній, але руйнівний артефакт. Піґліни поклялися захищати його ціною власного життя. Прокляте око можна знайти в бастіоні піґлінів.",
            "item": "endrem:cursed_eye"
        },
        {
            "type": "spotlight",
            "title": "Зловісне Око",
            "text": "Священний талісман, який, як кажуть, захищає свого власника від невдач. Це око можна купити у селянина-священника, от тільки питання... Звідки в нього це око?",
            "item": "endrem:evil_eye"
        },
        {
            "type": "spotlight",
            "title": "Екзотичне Око",
            "text": "Тих, хто стежив за цим оком, більше ніхто не бачив. Воно таке гарне... Здається, воно підводне? Цікаво... Екзотичне око можна отримати, перемігши Левіафана глибоко під землею.",
            "item": "endrem:exotic_eye"
        },
        {
            "type": "spotlight",
            "title": "Око вартового",
            "text": "Воно бачило, як багато воїнів тонули в морських глибинах, і ніхто нічого не міг із цим вдіяти. Але ось питання: що або хто за цим стоїть? Око вартового можна отримати, перемігши Стародавнього вартового.",
            "item": "endrem:guardian_eye"
        },
        {
            "type": "spotlight",
            "title": "Загублене Око",
            "text": "Подейкують, що воно було викуване першими ковалями часу. Чому цей Передвісник так сильно схожий на Візера? Може, це його побратим?.. Загублене око можна отримати, перемігши Передвісника.",
            "item": "endrem:lost_eye"
        },
        {
            "type": "spotlight",
            "title": "Магічне Око",
            "text": "Без цього ока у власника немає жодного шансу вижити в інших умовах, які можуть зустрітися у світі. Воно надто гаряче, щоб бути у звичайному світі... Магічне око можна отримати, перемігши Ігніса.",
            "item": "endrem:magical_eye"
        },
        {
            "type": "spotlight",
            "title": "Око Незеру",
            "text": "Це око було втрачено під час жорстокої битви між Незером і Раєм. На жаль, Незер переміг у тій битві... Око Незеру можна отримати, перемігши Незеритове Страховисько.",
            "item": "endrem:nether_eye"
        },
        {
            "type": "spotlight",
            "title": "Старовинне око",
            "text": "Легенди свідчать, що це око колись належало одному з великих піщаних черв'яків. Воно надто страшне і дуже дивне... Мені здається, його треба вбити! Старовинне око можна отримати, перемігши Пустельного Ревенанта.",
            "item": "endrem:old_eye"
        },
        {
            "type": "spotlight",
            "title": "Око вигнанця",
            "text": "Вважається, що це око дало нашим предкам знання про редстоун. Але щось пішло не так, і воно потрапило до рук дивних чудовиськ з іншого виміру... Око вигнанця можна отримати, перемігши Нагу.",
            "item": "endrem:rogue_eye"
        },
        {
            "type": "crafting",
            "title": "Рецепт Ока Нежиті",
            "text": "Це око — сильний спогад про минулі життя тих, хто живе в болісній смерті...",
            "recipe": "endrem:undead_eye"
        },
        {
            "type": "crafting",
            "title": "Рецепт Ока Відьми",
            "text": "Вважається, що це око бачило стародавні рецепти зілляваріння, загублені в часі. Але хто знає, може, вона бачила не тільки рецепти, пов'язані з пивом?...",
            "recipe": "endrem:witch_eye"
        },
        {
            "type": "spotlight",
            "title": "На цьому все!",
            "text": "Тепер ви знаєте всю інформацію про 12 очей, а також про те, з кого вони випадають. Сподіваємося, ми вам допомогли, і ви будете знаходити очі набагато частіше, ніж раніше!",
            "item": "endrem:undead_soul"
        }
    ]
}